In [1]:
#!pip install ipython-sql

In [2]:
%load_ext sql

In [4]:
%sql postgresql://postgres:Speedy3861@localhost:5432/sql-cookbook

**1.1 Retrieving All Rows and Columns from a Table**<br>
**Problem** <br>
You have a table and want to see all of the data in it.

In [5]:
%%sql
select *
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[(7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(2006, 2, 20), 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, datetime.date(2006, 2, 22), 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(2006, 9, 28), 1250, 1400, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(2006, 9, 8), 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.date(2008, 1, 12), 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, datetime.date(2006, 12, 3), 950, None, 30),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3000, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10)]

In [6]:
%%sql
select *
from dept

 * postgresql://postgres:***@localhost:5432/sql-cookbook
4 rows affected.

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

### WHERE Condition
**1.2 Retrieving a Subset of Rows from a Table** <br>
**Problem** <br>
You have a table and want to see only rows that satisfy a specific condition. For example, check data of employees in department 10.

In [7]:
%%sql
select *
from employees
where deptno = 10

 * postgresql://postgres:***@localhost:5432/sql-cookbook
3 rows affected.

[(7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10)]

**1.3 Finding Rows That Satisfy Multiple Conditions Problem** <br>
You want to return rows that satisfy multiple conditions.<br>
Example, if you would like to find all the employees in department 10, along with any employees who earn a commission, along with any employees in department 20 who earn at most $2,000.

In [8]:
%%sql
select *
from employees
where deptno = 10 or
comm is not null or
deptno = 20 and sal <= 2000

 * postgresql://postgres:***@localhost:5432/sql-cookbook
9 rows affected.

[(7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(2006, 2, 20), 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, datetime.date(2006, 2, 22), 1250, 500, 30),
 (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(2006, 9, 28), 1250, 1400, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(2006, 9, 8), 1500, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.date(2008, 1, 12), 1100, None, 20),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10)]

### Selecting columns <br>
**1.4 Retrieving a Subset of Columns from a Table Problem** <br>
You have a table and want to see values for specific columns rather than for all the columns.

In [9]:
%%sql

select empno, ename, sal
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[(7369, 'SMITH', 800),
 (7499, 'ALLEN', 1600),
 (7521, 'WARD', 1250),
 (7566, 'JONES', 2975),
 (7654, 'MARTIN', 1250),
 (7698, 'BLAKE', 2850),
 (7782, 'CLARK', 2450),
 (7788, 'SCOTT', 3000),
 (7839, 'KING', 5000),
 (7844, 'TURNER', 1500),
 (7876, 'ADAMS', 1100),
 (7900, 'JAMES', 950),
 (7902, 'FORD', 3000),
 (7934, 'MILLER', 1300)]

### ALIASES
<br>
1.5 Providing Meaningful Names for Columns

In [10]:
%%sql

select ename as employee_name, sal as salary, comm as commision
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[('SMITH', 800, None),
 ('ALLEN', 1600, 300),
 ('WARD', 1250, 500),
 ('JONES', 2975, None),
 ('MARTIN', 1250, 1400),
 ('BLAKE', 2850, None),
 ('CLARK', 2450, None),
 ('SCOTT', 3000, None),
 ('KING', 5000, None),
 ('TURNER', 1500, 0),
 ('ADAMS', 1100, None),
 ('JAMES', 950, None),
 ('FORD', 3000, None),
 ('MILLER', 1300, None)]

You can see the name of the columns are changed into something that can be easily understood using aliases which can be implemented using 'as' keyword. It can also be implemented without using 'as' keyword, see the example below.

In [11]:
%%sql

select ename employee_name, sal salary, comm commision
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[('SMITH', 800, None),
 ('ALLEN', 1600, 300),
 ('WARD', 1250, 500),
 ('JONES', 2975, None),
 ('MARTIN', 1250, 1400),
 ('BLAKE', 2850, None),
 ('CLARK', 2450, None),
 ('SCOTT', 3000, None),
 ('KING', 5000, None),
 ('TURNER', 1500, 0),
 ('ADAMS', 1100, None),
 ('JAMES', 950, None),
 ('FORD', 3000, None),
 ('MILLER', 1300, None)]

**1.6 Referencing an Aliased Column in the WHERE Clause**

In [12]:
%%sql

select ename employee_name, sal salary, comm commision
from employees
where salary > 3000

 * postgresql://postgres:***@localhost:5432/sql-cookbook
(psycopg2.errors.UndefinedColumn) column "salary" does not exist
LINE 3: where salary > 3000
              ^
HINT:  Perhaps you meant to reference the column "employees.sal".

[SQL: select ename employee_name, sal salary, comm commision
from employees
where salary > 3000]
(Background on this error at: https://sqlalche.me/e/14/f405)

It shows an error. Why? The reason why we are getting an error is because at this stage when the WHERE clause is evaluated. Let's look at the order of operations:
<br>
1. FROM, including JOINs <br>
2. WHERE <br> 
3. GROUP BY <br>
4. HAVING <br>
5. WINDOW functions <br>
6. SELECT <br> 
7. DISTINCT <br>
8. UNION <br>
9. ORDER BY <br>
10. LIMIT and OFFSET

Since WHERE clause is run first, the columns are not selected yet. How to fix it?

In [16]:
%%sql 

select *
from (
select ename as employee_name, sal as salary, comm as commission
from employees) table_name_alias
where salary < 3000 and commission is not null and commission != 0

 * postgresql://postgres:***@localhost:5432/sql-cookbook
3 rows affected.

[('ALLEN', 1600, 300), ('WARD', 1250, 500), ('MARTIN', 1250, 1400)]

### CONCATENATE
<br>
1.7 Concatenating Column Values Problem<br>
You want to return values in multiple columns as one column. For example, you would like to produce this result set from a query against the EMP table:<br>
    CLARK WORKS AS A MANAGER<br>
    KING WORKS AS A PRESIDENT<br>
    MILLER WORKS AS A CLERK<br>
However, the data that you need to generate this result set comes from two different columns, the ENAME and JOB columns in the EMP table:

In [21]:
%%sql

select CONCAT(ename, ' WORKS AS A ', job, '.') as message
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[('SMITH WORKS AS A CLERK.',),
 ('ALLEN WORKS AS A SALESMAN.',),
 ('WARD WORKS AS A SALESMAN.',),
 ('JONES WORKS AS A MANAGER.',),
 ('MARTIN WORKS AS A SALESMAN.',),
 ('BLAKE WORKS AS A MANAGER.',),
 ('CLARK WORKS AS A MANAGER.',),
 ('SCOTT WORKS AS A ANALYST.',),
 ('KING WORKS AS A PRESIDENT.',),
 ('TURNER WORKS AS A SALESMAN.',),
 ('ADAMS WORKS AS A CLERK.',),
 ('JAMES WORKS AS A CLERK.',),
 ('FORD WORKS AS A ANALYST.',),
 ('MILLER WORKS AS A CLERK.',)]

### CASE STATEMENT (LOGIC) <br>
**1.8 Using Conditional Logic in a SELECT Statement Problem** <br>
You want to perform IF-ELSE operations on values in your SELECT statement. For example, you would like to produce a result set such that if an employee is paid $2,000 or less, a message of “UNDERPAID” is returned; if an employee is paid $4,000 or more, a message of “OVERPAID” is returned; and if they make somewhere in between, then “OK” is returned.

In [28]:
%%sql

select ename, sal,
    case when sal <= 2000 then 'UNDERPAID'
    when sal >= 4000 then 'OVERPAID'
    else 'OK' end as status
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[('SMITH', 800, 'UNDERPAID'),
 ('ALLEN', 1600, 'UNDERPAID'),
 ('WARD', 1250, 'UNDERPAID'),
 ('JONES', 2975, 'OK'),
 ('MARTIN', 1250, 'UNDERPAID'),
 ('BLAKE', 2850, 'OK'),
 ('CLARK', 2450, 'OK'),
 ('SCOTT', 3000, 'OK'),
 ('KING', 5000, 'OVERPAID'),
 ('TURNER', 1500, 'UNDERPAID'),
 ('ADAMS', 1100, 'UNDERPAID'),
 ('JAMES', 950, 'UNDERPAID'),
 ('FORD', 3000, 'OK'),
 ('MILLER', 1300, 'UNDERPAID')]

**1.8.1: Exercise** <br>
Write a SQL Query when commision is null or zero, add an adjacent column name 'COMMISSION' saying 'False', otherwise 'True' if employee gets commision.

In [30]:
%%sql
select empno, ename, comm,
case when comm is null or comm = 0 then 'False'
else 'True' end as COMMISSION
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[(7369, 'SMITH', None, 'False'),
 (7499, 'ALLEN', 300, 'True'),
 (7521, 'WARD', 500, 'True'),
 (7566, 'JONES', None, 'False'),
 (7654, 'MARTIN', 1400, 'True'),
 (7698, 'BLAKE', None, 'False'),
 (7782, 'CLARK', None, 'False'),
 (7788, 'SCOTT', None, 'False'),
 (7839, 'KING', None, 'False'),
 (7844, 'TURNER', 0, 'False'),
 (7876, 'ADAMS', None, 'False'),
 (7900, 'JAMES', None, 'False'),
 (7902, 'FORD', None, 'False'),
 (7934, 'MILLER', None, 'False')]

### LIMIT <br>
**1.9 Limiting the Number of Rows Returned** <br>
Check only top highest paid employees.

In [32]:
%%sql

select *
from employees
order by sal desc
limit 5

 * postgresql://postgres:***@localhost:5432/sql-cookbook
5 rows affected.

[(7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3000, None, 20),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3000, None, 20),
 (7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30)]

### RANDOM

**1.10 Returning n Random Records from a Table**

In [34]:
%%sql

select *
from employees
order by random()

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[(7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, datetime.date(2006, 9, 28), 1250, 1400, 30),
 (7844, 'TURNER', 'SALESMAN', 7698, datetime.date(2006, 9, 8), 1500, 0, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30),
 (7876, 'ADAMS', 'CLERK', 7788, datetime.date(2008, 1, 12), 1100, None, 20),
 (7900, 'JAMES', 'CLERK', 7698, datetime.date(2006, 12, 3), 950, None, 30),
 (7521, 'WARD', 'SALESMAN', 7698, datetime.date(2006, 2, 22), 1250, 500, 30),
 (7934, 'MILLER', 'CLERK', 7782, datetime.date(2007, 1, 23), 1300, None, 10),
 (7369, 'SMITH', 'CLERK', 7902, datetime.date(2005, 12, 17), 800, None, 20),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, datetime.date(2007, 12, 9), 3000, None, 20),
 (7902, 'FORD', 'ANALYST', 7566, datetime.date(2006, 12, 3), 3000, None, 20),
 (7839, 'KING', 'PRESIDENT', None, datetime.date(2006, 11, 17), 5000, None, 10),
 (7499, 'ALLEN', 'SALESMAN', 7698, datetime.date(2006, 2, 20), 1600, 300, 30)]

### COALESCE

**1.12 Transforming Nulls into Real Values**

In [38]:
%%sql

select ename, job, sal, coalesce(comm,0) as commission
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[('SMITH', 'CLERK', 800, 0),
 ('ALLEN', 'SALESMAN', 1600, 300),
 ('WARD', 'SALESMAN', 1250, 500),
 ('JONES', 'MANAGER', 2975, 0),
 ('MARTIN', 'SALESMAN', 1250, 1400),
 ('BLAKE', 'MANAGER', 2850, 0),
 ('CLARK', 'MANAGER', 2450, 0),
 ('SCOTT', 'ANALYST', 3000, 0),
 ('KING', 'PRESIDENT', 5000, 0),
 ('TURNER', 'SALESMAN', 1500, 0),
 ('ADAMS', 'CLERK', 1100, 0),
 ('JAMES', 'CLERK', 950, 0),
 ('FORD', 'ANALYST', 3000, 0),
 ('MILLER', 'CLERK', 1300, 0)]

You can also use the CASE statment to get the same results.

In [47]:
%%sql

select ename, job, sal,
case when comm is null then 0 else comm end as commission
from employees

 * postgresql://postgres:***@localhost:5432/sql-cookbook
14 rows affected.

[('SMITH', 'CLERK', 800, 0),
 ('ALLEN', 'SALESMAN', 1600, 300),
 ('WARD', 'SALESMAN', 1250, 500),
 ('JONES', 'MANAGER', 2975, 0),
 ('MARTIN', 'SALESMAN', 1250, 1400),
 ('BLAKE', 'MANAGER', 2850, 0),
 ('CLARK', 'MANAGER', 2450, 0),
 ('SCOTT', 'ANALYST', 3000, 0),
 ('KING', 'PRESIDENT', 5000, 0),
 ('TURNER', 'SALESMAN', 1500, 0),
 ('ADAMS', 'CLERK', 1100, 0),
 ('JAMES', 'CLERK', 950, 0),
 ('FORD', 'ANALYST', 3000, 0),
 ('MILLER', 'CLERK', 1300, 0)]

### WILDCARD (LIKE) operrator

**1.13 Searching for Patterns**

In [52]:
%%sql

select * 
from employees
where job like 'M%'

 * postgresql://postgres:***@localhost:5432/sql-cookbook
3 rows affected.

[(7566, 'JONES', 'MANAGER', 7839, datetime.date(2006, 4, 2), 2975, None, 20),
 (7698, 'BLAKE', 'MANAGER', 7839, datetime.date(2006, 5, 1), 2850, None, 30),
 (7782, 'CLARK', 'MANAGER', 7839, datetime.date(2006, 6, 9), 2450, None, 10)]

M% means, the word begins with M and anything that comes after doesn't matter. Let's try and find people where last alphabet of their name is 'T' and job is the same.

In [59]:
%%sql

select ename, job
from employees
where ename LIKE '%T' and job LIKE '%T'

 * postgresql://postgres:***@localhost:5432/sql-cookbook
1 rows affected.

[('SCOTT', 'ANALYST')]

### END OF CHAPTER